:PROPERTIES:
:ID: 950d0206-5cc7-49cd-ab84-af7e3d5c9f32
:END:
#+title: Get Roles for an Account
#+description: Get Roles for an Account
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:rbac_roles_and_permissions:
#+created: 2026-05-21
#+updated: 2026-05-21

#+begin_src sql
select a.username, r.name as role_name, ar.assigned_at, ar.assigned_by
from ores.account_roles ar
join ores.accounts a on a.id = ar.account_id
  and a.valid_to = '9999-12-31 23:59:59'::timestamptz
join ores.roles r on r.id = ar.role_id
  and r.valid_to = '9999-12-31 23:59:59'::timestamptz
where ar.valid_to = '9999-12-31 23:59:59'::timestamptz
  and a.username = 'admin'
order by r.name;
#+end_src

#+RESULTS:
#+begin_example
| username | role_name | assigned_at | assigned_by |
|----------+-----------+-------------+-------------|
#+end_example
